[
{"Name": ["Berkshire Hathaway"]},
{"Location": ["Omaha, Nebraska"]},
{"About": ["Berkshire Hathaway, Inc. provides property and casualty insurance and reinsurance, utilities and energy, freight rail transportation, finance, manufacturing, retailing, and services. It operates through following segments: GEICO, Berkshire Hathaway Reinsurance Group, Berkshire Hathaway Primary Group, Burlington Northern Santa Fe, LLC (BNSF), Berkshire Hathaway Energy, McLane Company, Manufacturing, and Service and Retailing. The GEICO segments involves in underwriting private passenger automobile insurance mainly by direct response methods. The Berkshire Hathaway Reinsurance Group segment consi... "]},
{"Name": ["Bank of China"]},
{"Location": ["Beijing, China"]},
{"About": ["Bank of China Ltd. engages in the provision of banking and financial services. It operates through the following business segments: Corporate Banking, Personal Banking, Treasury Operations, Investment Banking, Insurance, and Others. The Corporate Banking segment offers services to corporate customers, government authorities, and financial institutions such as current accounts, deposits, overdrafts, loans, custody, trade related products and other credit facilities, foreign currency, and derivative products. The Personal Banking segment provides services to retail customers such as current accou... "]},
{"Name": ["Microsoft"]},
{"Location": ["Redmond, Washington"]},
{"About": ["Microsoft Corp. engages in the development and support of software, services, devices, and solutions. It operates through the following business segments: Productivity and Business Processes; Intelligent Cloud; and More Personal Computing. The Productivity and Business Processes segment comprises products and services in the portfolio of productivity, communication, and information services of the company spanning a variety of devices and platform. The Intelligent Cloud segment refers to the public, private, and hybrid serve products and cloud services of the company which can power modern busi... "]},
{"Name": ["AT&T"]},
{"Location": ["Dallas, Texas"]},
{"About": ["AT&T, Inc. is a holding company, which engages in the provision of telecommunications media and technology service. It operates through the following segments: Communications, WarnerMedia, Latin America and Xandr. The Communications segment provides services to businesses and consumers located in the U.S., or in U.S. territories, and businesses globally. The WarnerMedia segment develops, produces and distributes feature films, television, gaming and other content over various physical and digital formats. The Latin America segment provides entertainment and wireless services outside of the U.S.... "]},
{"Name": ["Wells Fargo"]},
{"Name": ["Ping An Insurance Group"]},
{"Location": ["Shenzhen, China"]},
{"Name": ["Alphabet"]},
{"Location": ["Mountain View, California"]},
{"Location": ["San Francisco, California"]},
{"About": ["Wells Fargo & Co. is a diversified, community-based financial services company. It is engaged in the provision of banking, insurance, investments, mortgage, and consumer and commercial finance. It firm operates through the following segments: Community Banking, Wholesale Banking, Wealth & Investment Management, and Other. The Community Banking segment offers complete line of diversified financial products and services for consumers and small businesses including checking and savings accounts, credit and debit cards, and automobile, student, and small business lending. The Wholesale Banking segm... "]},
{"About": ["Ping An Insurance (Group) Co. of China Ltd. engages in the provision of financial products and services. It operates through the following segments: Insurance, Banking, Trust, Securities, Other Asset Management, Technology, and Others. The Insurance segment offers life, property and casualty, pension, and health insurance services. The Banking segment undertakes loan and intermediary business, wealth management, and credit card services. The Trust segment provides trust services and undertakes investing activities. The Securities segment undertakes brokerage, trading, investment banking and ass... "]},
{"Name": ["Verizon Communications"]},
{"Name": ["ExxonMobil"]},
{"Name": ["Samsung Group"]},
{"Location": ["Suwon, South Korea"]},
{"Name": ["Shell"]},
{"Location": ["London, United Kingdom"]},
{"About": ["Royal Dutch Shell Plc engages in the oil and natural gas production. It operates through the following segments: Integrated Gas, Upstream, Downstream, and Corporate. The Integrated Gas segment manages liquefied natural gas activities and the conversion of natural gas into gas to liquids fuels and other products. The Upstream segment manages the exploration for and extraction of crude oil, natural gas, and natural gas liquids. The Downstream segment manages different oil products and chemical activities as part of an integrated value chain, including trading activities, what turns crude oil and... "]},
{"Location": ["New York, New York"]},
{"About": ["Verizon Communications, Inc. is a holding company, which engages in the provision of communications, information, and entertainment products and services to consumers, businesses, and governmental agencies. It operates through the Verizon Consumer Group (Consumer) and Verizon Business Group (Business) segments. The Consumer segment provides consumer-focused wireless and wire line communications services and products. The Business segment offers wireless and wire line communications services and products; video and data services; corporate networking solutions; security and managed network servi... "]},
{"Location": ["Irving, Texas"]},
{"About": ["Samsung Electronics is a South Korean multinational electronics corporation. Samsung inspires the world and shapes the future with transformative ideas and technologies. The company is redefining the worlds of TVs, smartphones, wearable devices, tablets, digital appliances, network systems, and memory, system LSI, foundry and LED solutions. \n", "\n", "\nTo strengthen synergies among the diverse businesses and create differentiated products and services, Samsung operates under two core divisions: DX (Device eXperience), which includes businesses for Visual Display, Digital Appliances, Mobile eXperience, N... "]},
{"Name": ["Apple"]},
{"Location": ["Cupertino, California"]},
{"About": ["Apple, Inc. engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. It operates through the following geographical segments: Americas, Europe, Greater China, Japan, and Rest of Asia Pacific. The Americas segment includes North and South America. The Europe segment consists of European countries, as well as India, the Middle East, and Africa. The Greater China segment comprises of China, Hong Kong, and Taiwan. The Rest of Asia Pacific segment includes Australia and Asian countries. Its products an... "]},
{"Name": ["Toyota Motor"]},
{"Location": ["Toyota, Japan"]},
{"About": ["Toyota Motor Corp. engages in the manufacture and sale of motor vehicles and parts. It operates through the following segments: Automotive, Financial Services, and All Other. The Automotive segment designs, manufactures, assembles and sells passenger cars, minivans, trucks, and related vehicle parts and accessories. It is also involved in the development of intelligent transport systems. The Financial Services segment offers purchase or lease financing to Toyota vehicle dealers and customers. It also provides retail leasing through lease contracts purchase by dealers. The All Others segment dea... "]},
{"Name": ["Bank of America"]},
{"Name": ["JPMorgan Chase"]},
{"Location": ["New York, New York"]},
{"Location": ["Charlotte, North Carolina"]},
{"About": ["Bank of America Corp. is a bank and financial holding company, which engages in the provision of banking and nonbank financial services. It operates through the following segments: Consumer Banking, Global Wealth and Investment Management, Global Banking, Global Markets, and All Other. The Consumer Banking segment offers credit, banking, and investment products and services to consumers and small businesses. The Global Wealth and Investment Management provides client experience through a network of financial advisors focused on to meet their needs through a full set of investment management, br... "]},
{"About": ["JPMorgan Chase & Co. is a financial holding company. It provides financial and investment banking services. The firm offers a range of investment banking products and services in all capital markets, including advising on corporate strategy and structure, capital raising in equity and debt markets, risk management, market making in cash securities and derivative instruments, and brokerage and research. It operates through the following segments: Consumer and Community Banking, Corporate and Investment Bank, Commercial Banking and Asset and Wealth Management. The Consumer and Community Banking s... "]},
{"Name": ["China Construction Bank"]},
{"Location": ["Beijing, China"]},
{"Name": ["Agricultural Bank of China"]},
{"Location": ["Beijing, China"]},
{"About": ["China Construction Bank Corp. engages in the provision of a wide range of financial services to corporate and personal customers. It operates through the following business segments: Corporate Banking, Personal Banking, Treasury, and Others. The Corporate Banking segment provides a range of financial products and services to corporations, government agencies and financial institutions, which comprises of corporate loans, trade financing, deposit taking and wealth management services, agency services, financial consulting and advisory services, cash management services, remittance and settlement... "]},
{"About": ["Agricultural Bank of China engages in the provision of international commercial banking and financial services. It operates through the following segments: Corporate Banking, Personal Banking, Treasury Operations and Others & Unallocated. The Corporate Banking segment provides financial products and services to corporations, government agencies and financial institutions. The Personal Banking segment provides financial products and services to individual customers. The Treasury Operations segment conducts money market or repurchases transactions, debt instrument investments, and holding of deri... "]},
{"Name": ["Amazon"]},
{"Name": ["ICBC"]},
{"Location": ["Beijing, China"]},
{"Name": ["Saudi Arabian Oil Company (Saudi Aramco)"]},
{"Location": ["Dhahran, Saudi Arabia"]},
{"About": ["Saudi Arabian Oil Co. engages in the exploration, production, transportation, and sale of crude oil and natural gas. It operates through the following segments: Upstream, Downstream, and Corporate. The Upstream segment includes crude oil, natural gas and natural gas liquids exploration, field development, and production. The Downstream segment focuses on refining, logistics, power generation, and the marketing of crude oil, petroleum and petrochemical products, and related services to international and domestic customers. The Corporate segment offers supporting services including human resource... "]},
{"Location": ["Seattle, Washington"]},
{"About": ["Amazon.com, Inc. engages in the provision of online retail shopping services. It operates through the following business segments: North America, International, and Amazon Web Services (AWS). The North America segment includes retail sales of consumer products and subscriptions through North America-focused websites such as www.amazon.com and www.amazon.ca. The International segment offers retail sales of consumer products and subscriptions through internationally-focused websites. The Amazon Web Services segment involves in the global sales of compute, storage, database, and AWS service offeri... "]},
{"About": ["Industrial & Commercial Bank of China Ltd. engages in the provision of commercial banking and financial services. It operates through the following business segments: Corporate Banking, Personal Banking, Treasury Operations, and Others. The Corporate Banking segment provides corporate loans, trade financing, deposit-taking activities, corporate wealth management services, custody activities, and various types of corporate intermediary services to corporations, government agencies and financial institutions. The Personal Banking segment offers personal loans, deposit-taking activities, card busi... "]}
]